src/main/resources/xml/accommodationFulfillmentServicePort/retrieveServiceRequests/retrieveServiceRequests.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:acc="http://accommodation.transferobject.fulfillment.lodging.wdw.com">
   <soapenv:Header/>
   <soapenv:Body>
      <acc:retrieveServiceRequests>
         <request>
            <!--Optional:-->
            <travelPlanId>?</travelPlanId>
            <!--Optional:-->
            <travelComponentId>?</travelComponentId>
            <!--Optional:-->
            <travelComponentServiceRequestId>?</travelComponentServiceRequestId>
            <!--Optional:-->
            <serviceRequestIdRequired>?</serviceRequestIdRequired>
         </request>
         <serviceContext>
            <addressRole>?</addressRole>
            <conversationId>?</conversationId>
            <messageId>?</messageId>
            <party1Id>?</party1Id>
            <party1Type>?</party1Type>
            <party2Id>?</party2Id>
            <party2Type>?</party2Type>
            <pathHostName>?</pathHostName>
            <pathId>?</pathId>
            <principalId>?</principalId>
            <principalMethod>?</principalMethod>
            <principalRole>?</principalRole>
            <principalUri>?</principalUri>
            <principalValue>?</principalValue>
            <requestTimeStamp>?</requestTimeStamp>
            <toAddressRole>?</toAddressRole>
            <userName>?</userName>
         </serviceContext>
      </acc:retrieveServiceRequests>
   </soapenv:Body>
</soapenv:Envelope>
